{
  "title": "Google Ads",
  "description": "[Google Ads](https://ads.google.com/home/) is an online advertising solution that businesses use to promote their products and services on Google Search, YouTube, and other sites across the web. Google Ads also allows advertisers to choose specific goals for their ads, like driving phone calls or website visits. With a Google Ads account, advertisers can customize their budgets and targeting, and start or stop their ads at any time.\n\n### API Version\nThe Google Ads community connector uses the [Google Ads](https://developers.google.com/google-ads/api/rest/overview) apis.  Provide the desired version in the connection block.\n\n\n### How to connect to Google Ads on Workato\n1. Client ID/Client secret - Credentials from Google Developers Console.\n     Required scopes: https://www.googleapis.com/auth/adwords\n2. Developer token - The developer token generated when you signed up for Google Ads API.\n3. Manager account customer ID - Customer ID of the target Google Ads manager account.\n4. API version - e.g. v9. You can check the latest version [here](https://developers.google.com/google-ads/api/rest/overview) \n\n## What can you do with this connector\n1. Add events to Google calendar when a new campaign was launched in Google Ads.\n2. Retrieve advertising reports based on filters and sync it to your spreadsheet apps like Google Sheets, Smartsheet, or Airtable.\n3. Update your Trello cards and send email notifications from new Google Ads campaigns.\n\n\n## Any bugs?\nThis connector was built and is supported by Workato. Send all your bug reports or enhancement requests through our support channels found [here](https://support.workato.com/support/tickets/new) or get support via intercom at the bottom right of your screen. Let our support team know the name of this connector and that it was installed from the community for them to properly route your support tickets.",
  "logo_file_name": "data",
  "logo_content_type": "image/jpeg",
  "version_no": 1,
  "note": "Installed from community"
}